Repository: pruby/GNUnet-Mirror
Catalog: po/*.po
Languages: vi

source: Received malformed message from tcp6-peer connection. Closing connection.
vi: Nhận được thông báo bị hỏng từ kết nối tcp6-đầu peer. Đang đóng kết nối.

source: %s: Rejected connection from blacklisted address %s.
vi: %s: Nhả ra kết nối có trong danh sách đen từ địa chỉ %s.

source: Could not determine my public IPv6 address.
vi: Không nhận ra địa chỉ IPv6 của tôi.

source: Failed to bind to UDP port %d.
vi: Không kết gắn được tới cổng UDP %d.

source: Received invalid UDP message from %u.%u.%u.%u:%u, dropping.
vi: Nhận được thông báo UDP sai từ %u.%u.%u.%u:%u, đang loại bỏ.

source: Packet received from %u.%u.%u.%u:%u (UDP) failed format check.
vi: Kiểm tra định dạng gói nhận được từ %u.%u.%u.%u:%u (UDP) không thành công.

source: UDP: Could not determine my public IP address.
vi: UDP: Không nhận ra địa chỉ IP công cộng của tôi.

source: Failed to send message of size %d via UDP to %u.%u.%u.%u:%u: %s
vi: Gửi thông báo với kích thước %d qua UDP tới %u.%u.%u.%u:%u không thành công: %s

source: # bytes received via UDP
vi: # byte nhận được qua UDP

source: # bytes sent via UDP
vi: # byte gửi qua UDP

source: # bytes dropped by UDP (outgoing)
vi: # byte loại bỏ bởi UDP (đi ra)

source: GNUnet now uses the IP address %u.%u.%u.%u.
vi: GNUnet bây giờ sử dụng địa chỉ IP %u.%u.%u.%u.

source: Failed to obtain my (external) IP address!
vi: Lấy địa chỉ IP (ngoài) của tôi không thành công!

source: Failed to bind to UDP6 port %d.
vi: Kết gắn bind tới cổng UDP6 %d không thành công.

source: Received invalid UDP6 message from %s:%d, dropping.
vi: Nhận được thông báo UDP6 sai từ %s: %d, đang loại bỏ.

source: Packet received from %s:%d (UDP6) failed format check.
vi: Kiểm tra định dạng gói nhận được từ %s:%d (UDP6) thất bại.

source: UDP6: Could not determine my public IPv6 address.
vi: UDP6: Không nhận ra địa chỉ IP công cộng của tôi.

source: Cron stopped
vi: Đã dừng cron

source: Initialization of plugin mechanism failed: %s!
vi: Chạy cơ chế plugin không thành công: %s!

source: %s: option `%s' is ambiguous
vi: %s: tùy chọn '%s' không rõ ràng

source: %s: option `--%s' does not allow an argument
vi: %s: tùy chọn `--%s' không cho phép một tham số

source: %s: option `%c%s' does not allow an argument
vi: %s: tùy chọn `%c%s' không cho phép một tham số

source: %s: option `%s' requires an argument
vi: %s: tùy chọn `%s' cần một tham số

source: %s: unrecognized option `--%s'
vi: %s: tùy chọn không nhận ra `--%s'

source: %s: unrecognized option `%c%s'
vi: %s: tùy chọn không nhận ra `%c%s'

source: %s: illegal option -- %c
vi: %s: tùy chọn không hợp lệ -- %c

source: %s: invalid option -- %c
vi: %s: tùy chọn sai -- %c

source: %s: option requires an argument -- %c
vi: %s: tùy chọn cần một tham số -- %c

source: %s: option `-W %s' is ambiguous
vi: %s: tùy chọn `-W %s' không rõ ràng

source: %s: option `-W %s' does not allow an argument
vi: %s: tùy chọn `-W %s' không cho phép một tham số

source: RSA signature verification failed at %s:%d: %s
vi: Kiểm tra chữ ký RSA thất bại tại %s:%d: %s

source: Shutdown complete.
vi: Tắt xong.

source: Caught signal %d.
vi: Bắt được tín hiệu %d.

source: libgcrypt has not the expected version (version %s is required).
vi: libgcrypt không có phiên bản mong đợi (yêu cầu phiên bản %s).

source: Invalid network notation ('/%d' is not legal in IPv4 CIDR).
vi: Ký hiệu mạng sai ('/%d' không hợp lệ trong CIDR IPv4).

source: NOTHING
vi: KHÔNGCÓGÌ

source: FATAL
vi: LỖI NẶNG

source: ERROR
vi: LỖI

source: FAILURE
vi: THẤT BẠI

source: WARNING
vi: CẢNH BÁO

source: MESSAGE
vi: TIN NHẮN

source: INFO
vi: THÔNGTIN

source: DEBUG
vi: TÌMLỖI

source: EVERYTHING
vi: MỌITHỨ

source: Failure at %s:%d.
vi: Thất bại tại %s: %d.

source: Usage: %s %s
vi: Sử dụng: %s %s

source: Arguments mandatory for long options are also mandatory for short options.
vi: Tham số cho tùy chọn dài cũng là tham số cho tùy chọn ngắn.

source: Can't create semaphore: %i
vi: Không tạo được đèn tín hiệu: %i

source: Configuration file must specify a directory for GNUnet to store per-peer data under %s\%s.
vi: Tập tin cấu hình phải chỉ ra một thư mục để GNUnet chứa các dữ liệu per-peer dưới %s\%s.

source: Cannot query the CPU usage (Windows NT).
vi: Không hỏi được sự sử dụng CPU (Windows NT).

source: Cannot query the CPU usage (Win 9x)
vi: Không hỏi được sự sử dụng CPU (Windows 9x).

source: m
vi: phút

source: ms
vi: mili giây

source: s
vi: giây

source: h
vi: giờ

source: days
vi: ngày

source: Unexpected very large allocation (%u bytes) at %s:%d!
vi: Không mong đợi một phân phối rất rộng (%u) tại %s:%d!

source: print this help
vi: in trợ giúp này

source: set verbosity to LEVEL
vi: đặt mức độ thông báo chi tiết thành LEVEL

source: use configuration file FILENAME
vi: dùng tập tin cấu hình FILENAME

source: specify host on which gnunetd is running
vi: chỉ ra máy đang chạy gnunetd

source: print the version number
vi: in số của phiên bản

source: be verbose
vi: thông báo chi tiết

source: Assertion failed at %s:%d.
vi: Xác nhận thất bại tại %s:%d.
