Repository: pruby/GNUnet-Mirror
Catalog: po/*.po
Languages: vi

source: Advertising my transport %d to selected peers.
vi: Đang quảng cáo giao thông %d tới các đầu peer đã chọn.

source: Announcing ourselves pointless: no other peers are known to us so far.
vi: Đang tự thông báo sự vô nghĩa: chúng ta không còn biết đến một đầu peer nào.

source: # Peer advertisements received
vi: # Nhận được quảng cáo của đầu peer

source: # Self advertisments transmitted
vi: # Đã truyền tải tự quảng cáo

source: # Foreign advertisements forwarded
vi: # Đã chuyển tiếp quàng cáo ngoài

source: Network advertisements disabled by configuration!
vi: Tắt quàng cáo trong mạng bằng cấu hình!

source: Invalid port "%s" in hostlist specification, trying port %d.
vi: Cổng sai "%s" nằm trong xác định danh sách máy, đang thử cổng %d.

source: Message received from peer is invalid.
vi: Thông báo nhận được từ một đầu là sai.

source: Message received from client is invalid
vi: Thông báo nhận được từ máy khách là sai.

source: Maximum number of chat clients reached.
vi: Đã đạt tới số máy khách chát lớn nhất.

source: Now %d of %d chat clients at this node.
vi: Bây giờ có %d từ %d máy khách chát tại nút này.

source: specify nickname
vi: chỉ ra tên nick

source: Start GNUnet chat client.
vi: Chạy máy khách chát của GNUnet.

source: Use --help to get a list of options.
vi: Dùng --help để xem danh sách các tùy chọn.

source: Could not connect to gnunetd.
vi: Không kết nối được tới gnunetd.

source: Could not send join message to gnunetd
vi: Không gửi được thông báo nhập join tới gnunetd

source: Could not send message to gnunetd
vi: Không gửi được thông báo tới gnunetd

source: sendAck failed. Terminating connection to client.
vi: Gửi sendAck không thành công. Ngắt kết nối tới máy khách.

source: allow SIZE bytes of memory for the local table
vi: cho phép SIZE byte bộ nhớ cho bảng nội bộ

source: join table called NAME
vi: nhập bảng có tên TÊN

source: Join a DHT.
vi: Nhập một DHT.

source: Superflous arguments (ignored).
vi: Tham số thừa (lờ đi).

source: Error joining DHT.
vi: Lỗi nhập DHT.

source: Joined DHT. Press CTRL-C to leave.
vi: Đã nhập DHT. Nhấn CTRL-C để dời khỏi.

source: Error leaving DHT.
vi: Lỗi dời khỏi DHT.

source: query table called NAME
vi: hỏi bảng có tên NAME

source: allow TIME ms to process each command
vi: cho phép TIME mili giây để tiến hành mỗi câu lệnh

source: Query (get KEY, put KEY VALUE, remove KEY VALUE) a DHT table.
vi: Hỏi (nhận KEY, đặt KEY VALUE, xoá bỏ KEY VALUE) một bảng DHT.

source: No commands specified.
vi: Chưa chỉ ra câu lệnh.

source: '%s(%s,%s)' succeeded
vi: '%s(%s,%s)' đã thành công

source: '%s(%s,%s)' failed.
vi: '%s(%s,%s)' thất bại.

source: Failed to connect to gnunetd.
vi: Kết nối tới gnunetd không thành công.

source: Received unknown request type %d at %s:%d
vi: Nhận được yêu cầu không rõ dạng %d tại %s:%d

source: This client already participates in the given DHT!
vi: Máy khách này đã tham gia trong DHT đưa ra!

source: Cannot leave DHT: table not known!
vi: Không rời bỏ được DHT: bảng không biết!

source: # of connected peers
vi: # của các đầu đã kết nối

source: Waiting for gnunetd to start (%u iterations left)...
vi: Đang chờ chạy gnunetd (còn %u lần thử)...

source: Waiting for peers to connect (%u iterations left)...
vi: Đang chờ kết nối các đầu (còn %u lần thử)...

source: # messages defragmented
vi: # thông báo đã gom lại

source: # messages fragmented
vi: # thông báo đã phân mảnh

source: # fragments discarded
vi: # các mảnh bị loại bỏ

source: Decrypted content does not match key. This is either a bug or a maliciously inserted file. Download aborted.
vi: Nội dung đã giải mã không tương ứng chìa khóa. Đây là một lỗi bug hoặc một tập tin chèn vào với ý xấu. Dừng tải xuống.

source: Configuration file must specify a directory for GNUnet to store per-peer data under %s%s.
vi: Tập tin cấu hình phải chỉ ra một thư mục để GNUnet chứa các dữ liệu per-peer dưới %s%s.

source: CHK URI not allowed for search.
vi: Không cho phép tìm kiếm CHK URI.

source: LOC URI not allowed for search.
vi: Không cho phép tìm kiếm LOC URI.

source: Indexing data failed at position %i.
vi: Đánh chỉ mục dữ liệu thất bại tại vị trí %i.

source: Download aborted.
vi: Dừng tải xuống.

source: ECRS download failed (see logs).
vi: Tải xuống ECRS thất bại (hãy xem các bản ghi log).

source: AND
vi: VÀ

source: Collecting file identifiers disabled.
vi: Tắt bỏ thu thập tên tập tin.

source: FSUI persistence: error restoring download
vi: FSUI: lỗi phục hồi tải xuống

source: No keywords specified!
vi: Chưa chỉ ra từ khóa!

source: Publication interval for periodic publication changed.
vi: Đã thay đổi khoảng thời gian giữa các lần đưa ra chia sẻ cho chia sẻ định kỳ.

source: Publishing update for periodically updated content more than a week ahead of schedule.
vi: Đang đưa ra các cập nhật cho nội dung cập nhật thường xuyên trước một tuần so với lịch.

source: This search is already pending!
vi: Tìm kiếm này đang chờ đợi!

source: Upload failed.
vi: Tải lên thất bại.

source: Cannot upload directory without using recursion.
vi: Không tải lên được thư mục khi không dùng đệ quy.

source: Failed to get traffic stats.
vi: Lấy các thông tin truyền tải không thành công.

source: %8u of %8u bytes deleted.
vi: Đã xóa %8u của %8u byte.

source: specify the file to delete from GNUnet (obligatory, file must exist)
vi: chỉ ra tập tin để xóa khỏi GNUnet (bắt buộc, tập tin phải tồn tại)

source: Remove file from GNUnet. The specified file is not removed from the filesystem but just from the local GNUnet datastore.
vi: Xóa tập tin khỏi GNUnet. Chưa xóa bỏ tập tin chỉ ra khỏi hệ thống tập tin nhưng đã xoá khỏi kho dữ liệu GNUnet nội bộ.

source: You must specify a filename (option -f)
vi: Người dùng phải chỉ ra một tên tập tin (tùy chọn -f)

source: Error deleting file %s. Probably a few blocks were already missing from the database.
vi: Lỗi xóa tập tin %s. Có thể đã mất vài khối trong cơ sở dữ liệu.

source: = Error reading directory.
vi: = Lỗi đọc thư mục.

source: File format error (not a GNUnet directory?)
vi: Lỗi định dạng tập tin (không phải một thư mục GNUnet?)

source: %d files found in directory.
vi: Tìm thấy %d tập tin trong thư mục.

source: remove all entries from the directory database and stop tracking URIs
vi: xóa bỏ mọi mục từ cơ sở dữ liệu thư mục và dừng theo dấu vết các URI

source: list entries from the directory database
vi: liệt kê tất cả các mục từ cơ sở dữ liệu thư mục

source: start tracking entries for the directory database
vi: bắt đầu theo dõi các mục cho cơ sở dữ liệu thư mục

source: gnunet-directory [OPTIONS] [FILENAMES]
vi: gnunet-directory [TÙYCHỌN] [TÊNTẬPTIN]

source: Perform directory related operations.
vi: Thực hiện các thao tác có liên quan đến thư mục.

source: Listed %d matching entries.
vi: Đã liệt kê %d mục tương ứng.

source: LEVEL
vi: CẤPĐỘ

source: set the desired LEVEL of receiver-anonymity
vi: đặt CẤPĐỘ mong muốn của người nhận giấu tên

source: FILENAME
vi: TÊNTẬPTIN

source: write the file to FILENAME
vi: ghi tập tin vào TÊNTẬPTIN

source: download a GNUnet directory recursively
vi: tải xuống đệ quy một thư mục GNUnet

source: Download files from GNUnet.
vi: Tải tập tin từ GNUnet.

source: Not enough arguments. You must specify a GNUnet file URI
vi: Không đủ tham số. Người dùng phải chỉ ra một URI tập tin của GNUnet

source: Error downloading: %s
vi: Lỗi tải xuống: %s

source: Error uploading file: %s
vi: Lỗi tải lên tập tin: %s

source: set the desired LEVEL of sender-anonymity
vi: đặt LEVEL (CẤPĐỘ) mong muốn của người gửi giấu tên

source: even if gnunetd is running on the local machine, force the creation of a copy instead of making a link to the GNUnet share directory
vi: thậm chí nếu gnunetd đang chạy trên máy nội bộ, bắt buộc tạo một bản sao thay vì tạo một liên kết đến thư mục chia sẻ của GNUnet

source: print list of extracted keywords that would be used, but do not perform upload
vi: in ra danh sách của các từ khóa đã giải phóng cần sử dụng, nhưng không thực hiện tải lên

source: set interval for availability of updates to SECONDS (for namespace insertions only)
vi: đặt khoảng thời gian cho cập nhật thành GIÂY (chỉ cho sự chèn không gian tên)

source: add an additional keyword for the top-level file or directory (this option can be specified multiple times)
vi: thêm một từ khóa phụ cho tập tin hoặc thư mục cao nhất (có thể chỉ ra tùy chọn này nhiều lần)

source: add an additional keyword for all files and directories (this option can be specified multiple times)
vi: thêm một từ khóa phụ cho tất cả tập tin và thư mục (có thể chỉ ra tùy chọn này nhiều lần)

source: set the meta-data for the given TYPE to the given VALUE
vi: đặt dữ liệu meta cho TYPE đưa ra tới VALUE chỉ ra

source: do not index, perform full insertion (stores entire file in encrypted form in GNUnet database)
vi: không đánh chỉ mục, thực hiện việc chèn đầy đủ (chứa toàn bộ tập tin ở dạng mã hóa trong cơ sở dữ liệu GNUnet)

source: specify ID of an updated version to be published in the future (for namespace insertions only)
vi: chỉ ra ID của một phiên bản đã cập nhật để chia sẻ trong tương lai (chỉ cho sự chèn không gian tên)

source: specify the priority of the content
vi: chỉ ra ưu tiên của nội dung

source: publish the files under the pseudonym NAME (place file into namespace)
vi: đưa ra dùng chung các tập tin dưới tên hiệu TÊN (đặt tập tin vào không gian tên)

source: process directories recursively
vi: tiến hành đệ qui trên các thư mục

source: specifies this as an aperiodic but updated publication (for namespace insertions only)
vi: chỉ ra sự chia sẻ này không theo chu kỳ nhưng đã cập nhật (chỉ cho chèn không gian tên)

source: set the ID of this version of the publication (for namespace insertions only)
vi: đặt ID của phiên bản này của sự chia sẻ (chỉ cho chèn không gian tên)

source: specify creation time for SBlock (see man-page for format)
vi: chỉ ra thời gian tạo SBlock (xem trang man để biết định dạng)

source: ID of the previous version of the content (for namespace update only)
vi: ID của phiên bản trước của nội dung (chỉ cho sự cập nhật không gian tên)

source: Make files available to GNUnet for sharing.
vi: Cho phép GNUnet chia sẻ các tập tin.

source: You must specify a list of files to insert.
vi: Người dùng phải chỉ ra một danh sách tập tin để chèn.

source: Only one file or directory can be specified at a time.
vi: Chỉ có thể đưa ra một tập tin hay thư mục mỗi lần.

source: You must specify a file or directory to upload.
vi: Người dùng phải chỉ ra một tập tin hay thư mục để tải lên.

source: automate creation of a namespace by starting a collection
vi: tự động tạo một không gian tên bằng cách bắt đầu một thu thập

source: create a new pseudonym under the given NICKNAME
vi: tạo một tên hiệu mới dưới NICKNAME đưa ra

source: delete the pseudonym with the given NICKNAME
vi: xóa tên hiệu với TÊNNICK đưa ra

source: end automated building of a namespace (ends collection)
vi: kết thúc việc tự động xây dựng một không gian tên (kết thúc thu thập)

source: use the given keyword to advertise the namespace (use when creating a new pseudonym)
vi: sử dụng từ khóa đưa ra để quảng cáo không gian tên (dùng khi tạo một tên hiệu mới)

source: specify that the contents of the namespace are of the given MIMETYPE (use when creating a new pseudonym)
vi: cho biết rằng nội dung của không gian tên có dạng MIMETYPE (dùng khi tạo một tên hiệu mới)

source: do not generate an advertisement for this namespace (use when creating a new pseudonym)
vi: không tạo một quảng cáo cho không gian tên này (dùng khi tạo một tên hiệu mới)

source: do not list the pseudonyms from the pseudonym database
vi: không liệt kê tên hiệu từ cơ sở dữ liệu tên hiệu

source: specify NAME to be the realname of the user controlling the namespace (use when creating a new pseudonym)
vi: dùng NAME làm tên thật của điều khiển không gian tên của người dùng (dùng khi tạo một tên hiệu mới)

source: specify IDENTIFIER to be the address of the entrypoint to content in the namespace (use when creating a new pseudonym)
vi: dùng IDENTIFIER làm địa chỉ của điểm chỉ tới nội dung trong không gian tên (dùng khi tạo một tên hiệu mới)

source: set the rating of a namespace
vi: đặt xếp hạng của một không gian tên

source: use DESCRIPTION to describe the content of the namespace (use when creating a new pseudonym)
vi: dùng DESCRIPTION để mô tả nội dung của không gian tên (dùng khi tạo một tên hiệu mới)

source: specify the given URI as an address that contains more information about the namespace (use when creating a new pseudonym)
vi: dùng URI đưa ra làm địa chỉ chứa thêm thông tin về không gian tên (dùng khi tạo một tên hiệu mới)

source: Create new pseudonyms, delete pseudonyms or list existing pseudonyms.
vi: Tạo tên hiệu mới, xóa tên hiệu hoặc liệt kê các tên hiệu có.

source: Invalid arguments. Exiting.
vi: Tham số sai. Đang thoát.

source: Rating (after update): %d
vi: Xếp hạng (sau cập nhật): %d

source: Collection stopped.
vi: Dừng thu thập.

source: Failed to stop collection (not active?).
vi: Dừng thu thập không thành công (không hoạt động?).

source: Failed to start collection.
vi: Bắt đầu thu thập không thành công.

source: Could not access namespace information.
vi: Không truy cập được thông tin của không gian tên.

source: exit after receiving LIMIT results
vi: thoát sau khi nhận được kết quả GIỚIHẠN

source: write encountered (decrypted) search results to FILENAME
vi: ghi kết quả tìm kiếm tìm thấy (đã giải mã) vào tập tin FILENAME

source: wait TIMEOUT seconds for search results before aborting
vi: chờ kết quả tìm kiếm TIMEOUT giây trước khi thoát

source: Search GNUnet for files.
vi: Tìm kiếm tập tin trong GNUnet.

source: Not enough arguments. You must specify a keyword or identifier.
vi: Không đủ tham số. Người dùng phải chỉ ra một từ khóa hoặc một tên.

source: Starting search failed. Consult logs.
vi: Bắt đầu tìm kiếm thất bại. Hãy xem các bản ghi log.

source: Error converting arguments to URI!
vi: Lỗi chuyển đổi tham số tới URI!

source: %16llu of %16llu bytes unindexed (estimating %llu seconds to completion)
vi: Đã bỏ chỉ mục %16llu từ %16llu byte (sẽ hoàn thành sau %llu giây)

source: Error unindexing file: %s
vi: Lỗi bỏ đánh chỉ mục tập tin: %s

source: Unindex files.
vi: Tập tin đã bỏ đánh chỉ mục.

source: You must specify one and only one file to unindex.
vi: Người dùng phải chỉ ra một và chỉ một tập tin để bỏ đánh chỉ mục.

source: Cover traffic requested but traffic service not loaded. Rejecting request.
vi: Đã yêu cầu che truyền tải nhưng chưa nạp dịch vụ truyền tải. Đang nhả ra yêu cầu.

source: Cannot satisfy desired level of anonymity, ignoring request.
vi: Không thể thỏa mãn mức độ dấu tên mong muốn, đang lờ đi yêu cầu.

source: Traffic service failed to load; gap cannot ensure cover-traffic availability.
vi: Nạp dịch vụ truyền tải không thành công; lỗ hổng không thể chắc chắn khả năng truyền tải.

source: Configuration file must specify a directory for GNUnet to store per-peer data under %s%s
vi: Tập tin cấu hình phải chỉ ra thư mục cho GNUnet để chứa dữ liệu per-peer dưới %s%s

source: Creating new hostkey (this may take a while).
vi: Đang tạo chìa khóa máy mới (có thể cần một chút thời gian).

source: Could not create hostkey!
vi: Không tạo được chìa khóa máy!

source: Done creating hostkey.
vi: Đã tạo xong chìa khóa máy.

source: Received ping for another peer. Dropping.
vi: Nhận được ping cho đầu peer khác. Đang bỏ đi.

source: Received PING not destined for us!
vi: Nhận được PING không dành cho chúng ta!

source: Could not match PONG against any PING. Try increasing MAX_PING_PONG constant.
vi: Không tương ứng được PONG đối với bất kỳ PING. Hãy thử tăng hằng số MAX_PING_PONG.

source: Cannot create PING, table full. Try increasing MAX_PING_PONG.
vi: Không tạo được PING, bảng đầy. Hãy thử tăng MAX_PING_PONG.

source: # encrypted PONG messages received
vi: # nhận được thông báo PONG đã mã hóa

source: # plaintext PONG messages received
vi: # nhận được thông báo PONG dạng văn bản thường

source: # encrypted PING messages received
vi: # nhận được thông báo PING đã mã hóa

source: # PING messages created
vi: # đã tạo tin nhắn PING

source: # encrypted PONG messages sent
vi: # đã gửi thông báo PONG đã mã hóa

source: # plaintext PING messages sent
vi: # đã gửi các thông báo PING dạng văn bản thông thường

source: # encrypted PING messages sent
vi: # đã gửi các thông báo PING mã hóa

source: %s::%s - RPC %s:%p could not be registered: another callback is already using this name (%p)
vi: %s::%s - RPC %s:%p không đăng ký được: một gọi lại khác đã dùng tên này (%p)

source: %s::%s - RPC %s:%p could not be unregistered: another callback registered under that name: %p
vi: %s::%s - RPC %s:%p không đăng ký được: một gọi lại khác đã đăng ký dưới tên đó (%p)

source: %s::%s - RPC %s:%p could not be unregistered: not found
vi: %s::%s - RPC %s:%p không đăng ký được: không tìm thấy

source: %s::%s - async RPC %s:%p could not be unregistered: not found
vi: %s::%s - async RPC %s:%p không đăng ký được: không tìm thấy

source: Invalid message of type %u received. Dropping.
vi: Nhận được thông báo sai của dạng %u. Đang bỏ đi.

source: Dropping RPC request %u: message malformed.
vi: Đang bỏ đi yêu cầu RPC %u: thông báo hỏng.

source: RPC not unregistered: %s:%p
vi: Chưa bỏ đăng ký RPC: %s: %p

source: RPC async reply invalid.
vi: Câu trả lời async của RPC sai.

source: async RPC reply not received.
vi: Không nhận được câu trả lời async của RPC.

source: Cannot encrypt sessionkey, other peer not known!
vi: Không mã hóa được chìa khóa buổi làm việc, không biết đến đầu peer khác!

source: Error parsing encrypted session key, given message part size is invalid.
vi: Lỗi phân tích chìa khóa buổi làm việc đã mã hóa, kích thước của phần thông báo đưa ra là sai.

source: # session keys sent
vi: # đã gửi các phím buổi làm việc

source: # session keys rejected
vi: # đã nhả ra các phím buổi làm việc

source: # session keys accepted
vi: # đã chấp nhận các phím buổi làm việc

source: # sessions established
vi: # đã thiết lập buổi làm việc

source: Could not initialize libgnunetutil!
vi: Không chạy được libgnunetutil!

source: Unable to initialize SQLite.
vi: Không chạy được SQLite.

source: Uptime (seconds)
vi: Đã chạy (giây)

source: Supported peer-to-peer messages:
vi: Thông báo Peer to Peer được hỗ trợ:

source: Supported client-server messages:
vi: Thông báo máy khách-máy chủ hỗ trợ:

source: prints supported protocol messages
vi: in các thông báo giao thức hỗ trợ

source: Print statistics about GNUnet operations.
vi: In thống kê về các thao tác của GNUnet.

source: Error establishing connection with gnunetd.
vi: Lỗi thiết lập kết nối với gnunetd.

source: Error reading information from gnunetd.
vi: Lỗi đọc thông tin từ gnunetd.

source: % of allowed network load (up)
vi: % o tải mạng cho phép (lên)

source: % of allowed network load (down)
vi: % o tải mạng cho phép (xuống)

source: % of allowed cpu load
vi: % o tải cho phép của cpu

source: # bytes of noise received
vi: # byte nhận được do nhiễu đường truyền

source: output in gnuplot format
vi: kết quả ở dạng gnuplot

source: number of iterations
vi: số lần làm lại

source: number of messages to use per iteration
vi: số thông báo dùng cho mỗi lần làm lại

source: receiver host identifier (ENC file name)
vi: trình nhận tên máy (tên tập tin ENC)

source: message size
vi: kích thước thông báo

source: sleep for SPACE ms after each a message block
vi: ngủ SPACE miligiây sau mỗi khối tin nhắn

source: time to wait for the completion of an iteration (in ms)
vi: thời gian chờ sự hoàn thành của một lần lặp (theo miligiây)

source: number of messages in a message block
vi: số thông báo trong một khối tin nhắn

source: Start GNUnet transport benchmarking tool.
vi: Chạy công cụ kiểm tra truyền tải của GNUnet.

source: You must specify a receiver!
vi: Người dùng phải chỉ ra một trình nhận!

source: Time:
vi: Thời gian:

source: max %llums
vi: max %llu miligiây

source: min %llums
vi: min %llu miligiây

source: mean %8.4fms
vi: ý nghĩa %8.4f miligiây

source: variance %8.4fms
vi: khác nhau %8.4f miligiây

source: Loss:
vi: Mất:

source: mean %8.4f
vi: ý nghĩa %8.4f

source: variance %8.4f
vi: khác nhau %8.4f

source: Output format not known, this should not happen.
vi: Định dạng kết quả không rõ, điều này không nên xảy ra.

source: Did not receive the message from gnunetd. Is gnunetd running?
vi: Không nhận được thông báo từ gnunetd. gnunetd đang chạy?

source: Using %u messages of size %u for %u times.
vi: Sử dụng %u thông báo với kích thước %u trong %u lần.

source: Times: max %16llu min %16llu mean %12.3f variance %12.3f
vi: Thời gian: max %16llu min %16llu có nghĩa %12.3f biến %12.3f

source: Loss: max %16u min %16u mean %12.3f variance %12.3f
vi: Mất: max %16u min %16u có nghĩa %12.3f biến %12.3f

source: Failed to receive reply from gnunetd.
vi: Không nhận thành công câu trả lời từ gnunetd.

source: Running benchmark...
vi: Đang chạy thử mức độ (benchmark)...

source: helptext for -t
vi: trợ giúp cho -t

source: Template for gnunet-clients.
vi: Biểu mẫu cho gnunet-clients.

source: Start GNUnet-testbed helper.
vi: Chạy chương trình trợ giúp Start GNUnet-testbed.

source: Cannot connect to LOOPBACK port %d: %s
vi: Không kết nối được tới cổng quay lại LOOPBACK %d: %s

source: No client service started. Trying again in 30 seconds.
vi: Chưa chạy dịch vụ máy khách. Hãy thử lại sau 30 giây.

source: Error (%s) binding the TCP listener to port %d. No proxy service started. Trying again in %d seconds...
vi: Lỗi (%s) kết gắn bind trình nghe TCP vào cổng %d. Chưa chạy dịch vụ proxy. Hãy thử lại sau %d giây...

source: Rejected unauthorized connection from %u.%u.%u.%u.
vi: Đã nhả ra kết nối chưa xác thực từ %u.%u.%u.%u.

source: Protocol violation on socket. Expected command.
vi: Xâm phạm giao thức trên socket. Đã mong đợi câu lệnh.

source: Start GNUnet testbed controller.
vi: Chạy trình điều khiển testbed của GNUnet.

source: Malformed entry in the configuration in section %s under %s: %s
vi: Mục có định dạng sai trong phần %s dưới %s của cấu hình: %s

source: Could not send acknowledgement back to client.
vi: Không gửi được câu trả lời đã biết ack trở lại cho máy khách.

source: Received unknown testbed message of type %u.
vi: Nhận được thông báo testbed không rõ dạng %u.

source: unloading module failed. Notifying client.
vi: hủy nạp môđun không thành công. Đang cho máy khách biết.

source: '..' is not allowed in file name (%s).
vi: không cho phép '..' trong tên tập tin (%s).

source: Empty filename for UPLOAD_FILE message is invalid!
vi: Tên tập tin rỗng cho thông báo UPLOAD_FILE là sai!

source: Filename for UPLOAD_FILE message is not null-terminated (invalid!)
vi: Tên tập tin cho thông báo UPLOAD_FILE không phải là kết thúc rỗng (sai)!

source: Upload refused!
vi: Từ chối tải lên!

source: Invalid message received at %s:%d.
vi: Nhận được thông báo sai tại %s: %d.

source: received invalid testbed message of size %u
vi: nhận được thông báo testbed sai với kích thước %u

source: Received testbed message of type %u but unexpected size %u, expected %u
vi: Nhận được thông báo testbed dạng %u nhưng kích thước không mong đợi %u, mong đợi %u

source: No testbed URL given, not registered.
vi: Chưa đưa ra URL của testbed, không đăng ký.

source: Exit register (error: no http response read).
vi: Thoát trình đăng ký (lỗi: không đọc được câu trả lời http).

source: Syntax error in topology specification, skipping bytes.
vi: Lỗi cú pháp trong sự xác định địa hình học, bỏ qua byte.

source: probe network to the given DEPTH
vi: thử mạng tới độ sâu DEPTH đưa ra

source: specify output format; 0 for human readable output, 1 for dot, 2 for vcg
vi: chỉ ra định dạng kết quả; 0 - dạng người dùng dễ đọc, 1 - dấu chấm, 2 - vcg

source: use PRIO for the priority of the trace request
vi: dùng PRIO làm ưu tiên của yêu cầu theo dấu vết trace
