Repository: pruby/GNUnet-Mirror
Catalog: po/*.po
Languages: vi

source: wait DELAY seconds for replies
vi: chờ các câu trả lời DELAY giây

source: Trace GNUnet network topology.
vi: Theo dấu vết trace hình học của mạng GNUnet.

source: Format specification invalid. Use 0 for user-readable, 1 for dot, 2 for vcg.
vi: Định dạng bị sai. Dùng 0 cho người dùng dễ đọc, 1 cho chấm, 2 cho vcg.

source: Format specification invalid. Use 0 for user-readable, 1 for dot
vi: Định dạng sai. Dùng 0 cho người dùng dễ đọc, 1 cho chấm

source: Could not send request to gnunetd.
vi: Không gửi được yêu cầu tới gnunetd.

source: TRACEKIT: routing table full, trace request dropped
vi: TRACEKIT: bảng định tuyến đầy, bỏ đi yêu cầu theo vết trace

source: Failed to query gnunetd about traffic conditions.
vi: Lỗi khi hỏi gnunetd về các điều khoản truyền tải.

source: Did not receive reply from gnunetd about traffic conditions.
vi: Không nhận được câu trả lời từ gnunetd về các điều khoản truyền tải.

source: # bytes transmitted of type %d
vi: # byte đã truyền của dạng %d

source: # bytes received of type %d
vi: # byte nhận được của dạng %d

source: No transport of type %d known.
vi: Không biết đến giao thông dạng %d.

source: Gtk GNUnet Configurator
vi: Trình cấu hình Gtk của GNUnet

source: _File
vi: _Tập tin

source: _Load
vi: _Nạp

source: Load a config file
vi: Nạp một tập tin cấu hình

source: _Save
vi: _Ghi

source: Save the config in .config
vi: Ghi cấu hình vào .config

source: _Quit
vi: Th_oát

source: _Options
vi: Tùy _chọn

source: Show _name
vi: _Hiện tên

source: Show name
vi: Hiển thị tên

source: Show _range
vi: Hiện _xếp hạng

source: Show range (Y/M/N)
vi: Hiển thị xếp hạng (Y/M/N)

source: Show _data
vi: Hiển thị _dữ liệu

source: Show value of the option
vi: Hiển thị giá trị của tùy chọn

source: Show all _options
vi: Hiển thị mọi _tùy chọn

source: Show all options
vi: Hiển thị mọi tùy chọn

source: _Help
vi: Trợ _giúp

source: _Introduction
vi: _Giới thiệu

source: _About
vi: _Nói về

source: _License
vi: _Giấy phép

source: Goes up of one level (single view)
vi: Đi lên một mức độ (xem đơn)

source: Up
vi: Lên

source: Load
vi: Nạp

source: Save a config file
vi: Ghi một tập tin cấu hình

source: Save
vi: Ghi

source: Single view
vi: Xem đơn

source: Single
vi: Đơn

source: Split view
vi: Xem kép

source: Split
vi: Chia

source: Full view
vi: Xem đầy đủ

source: Full
vi: Đầy đủ

source: Collapse the whole tree in the right frame
vi: Cuộn lên toàn bộ cây trong khung bên phải

source: Collapse
vi: Cuộn lên

source: Expand the whole tree in the right frame
vi: Mở ra toàn bộ cây trong khung bên phải

source: Expand
vi: Mở ra

source: Sorry, no help available for this option yet.
vi: Rất tiếc, chưa có trợ giúp cho tùy chọn này.

source: Couldn't find pixmap file: %s
vi: Không tìm thấy tập tin ảnh pixmap: %s

source: Invalid arguments:
vi: Tham số sai:

source: GNUnet service installed successfully.
vi: Dịch vụ GNUnet đã cài đặt thành công.

source: This version of Windows doesn't support services.
vi: Phiên bản này của Windows không hỗ trợ các dịch vụ.

source: Error: can't open Service Control Manager: %s
vi: Lỗi: không mở được Trình Quản lý Dịch vụ: %s

source: Error: can't create service: %s
vi: Lỗi: không tạo được dịch vụ: %s

source: Unknown error.
vi: Lỗi không rõ.

source: Service deleted.
vi: Đã xóa bỏ dịch vụ.

source: Error: can't access service: %s
vi: Lỗi: không truy cập được dịch vụ: %s

source: Error: can't delete service: %s
vi: Lỗi: không xóa được dịch vụ: %s

source: Unable to create user account:
vi: Không tạo được tài khoản người dùng:

source: Unable to change startup process:
vi: Không thay đổi được tiến trình khởi động:

source: Error
vi: Lỗi

source: GNUnet configuration
vi: Cấu hình GNUnet

source: Choose the network interface that connects your computer to the internet from the list below.
vi: Chọn giao diện mạng kết nối máy tính tới internet từ danh sách dưới đây.

source: Help
vi: Trợ giúp

source: The "Network interface" is the device that connects your computer to the internet. This is usually a modem, an ISDN card or a network card in case you are using DSL.
vi: "Giao diện mạng" là thiết bị kết nối máy tính với internet. Đây thường là một môđem, một thẻ ISDN hay một thẻ mạng nếu dùng DSL.

source: What is the name of the network interface that connects your computer to the Internet?
vi: Tên của giao diện mạng kết nối máy tính tới Internet là gì?

source: What is this computer's public IP address or hostname? If in doubt, leave this empty.
vi: Địa chỉ IP công cộng hoặc tên của máy tính này là gì? Nếu không biết, hãy để trống.

source: If your provider always assigns the same IP-Address to you (a "static" IP-Address), enter it into the "IP-Address" field. If your IP-Address changes every now and then ("dynamic" IP-Address) but there's a hostname that always points to your actual IP-Address ("Dynamic DNS"), you can also enter it here. If in doubt, leave the field empty. GNUnet will then try to determine your IP-Address.
vi: Nếu nhà cung cấp luôn luôn gán cùng một địa chỉ IP (một địa chỉ IP "tĩnh"), thì hãy nhập địa chỉ đó vào vùng "IP-Address". Nếu địa chỉ IP thay đổi sau mỗi lần kết nối (địa chỉ IP "động") nhưng có một tên máy luôn luôn chỉ tới địa chỉ IP thực của bạn ("DNS động"), thì cũng có thể nhập nó ở đây. Nếu không biết phải làm gì, thì hãy để trống. GNUnet sẽ thử để nhận ra địa chỉ IP.

source: Is this machine behind NAT? If you are connected to the internet through another computer doing SNAT, a router or a "hardware firewall" and other computers on the internet cannot connect to this computer, say "yes" here. Answer "no" on direct connections through modems, ISDN cards and DNAT (also known as "port forwarding").
vi: Máy này nằm dưới NAT? Nếu kết nối internet qua một máy khác thực hiện SNAT, một bộ định tuyến router hay một "phần cứng tường lửa" và các máy khác trong internet không thể kết nối tới máy này, thì hãy chọn "yes". Trả lời "no" nếu kết nối thẳng qua môđem, thẻ ISDN, và DNAT (hay còng gọi là "chuyển tiếp cổng").

source: How much upstream (Bytes/s) may be used?
vi: Tốc độ ra giới hạn là bao nhiêu (Byte/giây)?

source: You can limit GNUnet's resource usage here. The "upstream" is the data channel through which data is *sent* to the internet. The limit is either the total maximum for this computer or how much GNUnet itself is allowed to use. You can specify that later. If you have a flatrate, you can set it to the maximum speed of your internet connection.
vi: Có thể giới hạn sử dụng tài nguyên của GNUnet ở đây. "Dòng ra" là kênh dữ liệu qua đó *gửi* dữ liệu tới internet. Có thể giới hạn hoặc cho cả máy tính này hoặc chỉ giới hạn cho GNUnet. Người dùng có thể chỉ ra nó sau này. Nếu có tốc độ đều, thì có thể đặt thành tốc độ kết nối internet lớn nhất.

source: How much downstream (Bytes/s) may be used?
vi: Dùng bao nhiêu (Byte/giây) cho dòng vào?

source: You can limit GNUnet's resource usage here. The "downstream" is the data channel through which data is *received* from the internet. The limit is either the total maximum for this computer or how much GNUnet itself is allowed to use. You can specify that later. If you have a flatrate you can set it to the maximum speed of your internet connection.
vi: Có thể giới hạn sử dụng tài nguyên của GNUnet ở đây. "Dòng vào" là kênh dữ liệu qua đó *nhận* dữ liệu từ internet. Có thể giới hạn hoặc cho cả máy tính này hoặc chỉ giới hạn cho GNUnet. Người dùng có thể chỉ ra nó sau này. Nếu có tốc độ đều, thì có thể đặt thành tốc độ kết nối internet lớn nhất.

source: Share denoted bandwidth with other applications? Say "yes" here, if you don't want other network traffic to interfere with GNUnet's operation, but still wish to constrain GNUnet's bandwidth usage to values entered in the previous steps, or if you can't reliably measure the maximum capabilities of your connection. "No" can be very useful if other applications are causing a lot of traffic on your LAN. In this case, you do not want to limit the traffic that GNUnet can inflict on your internet connection whenever your high-speed LAN gets used (e.g. by NFS).
vi: Chia sẻ băng thông chỉ ra với các ứng dụng khác? Chọn "yes", nếu không muốn các truyền tải mạng khác gây trở ngại đối với các thao tác của GNUnet, nhưng vẫn muốn bắt buộc dùng giá trị đã nhập trong các bước trước đây làm sử dụng băng thông của GNUnet, hoặc nếu người dùng không thể đo được khả năng lớn nhất của kết nối mạng. "No" có ích khi các ứng dụng khác dùng nhiều truyền tải trong mạng LAN. Trong trường hợp này, người dùng không nên giới hạn truyền tải GNUnet phải chịu trên kết nối internet mỗi khi sử dụng LAN tốc độ cao (ví dụ bởi NFS).

source: How much CPU (in %) may be used?
vi: Sử dụng bao nhiêu CPU (tính theo %)?

source: You can limit GNUnet's resource usage here. This is the percentage of processor time GNUnet is allowed to use.
vi: Có thể giới hạn nguồn sử dụng của GNUnet ở đây. Đây là phần trăm thời gian của bộ xử lý cho phép GNUnet sử dụng.

source: Store migrated content? GNUnet is able to store data from other peers in your datastore. This is useful if an adversary has access to your inserted content and you need to deny that the content is yours. With "content migration" on, the content could have "migrated" over the internet to your node without your knowledge. It also helps to spread popular content over different peers to enhance availability.
vi: Giữ nội dung nhập vào? GNUnet có thể chứa ghi nhớ dữ liệu từ các đầu peer khác trong kho dữ liệu. Tính năng này có ích nếu một đối tượng xấu truy cập tới nội dung đã chèn và người dùng cần loại bỏ nội dung đó. Khi "nhập nội dung" bật dùng, nội dung có thể "nhập" qua internet tới nút của người dùng mà người dùng không biết. Nó đồng thời giúp chia sẻ nội dung phổ biến qua các đầu peer khác nhau để dễ dàng truy cập.

source: What's the maximum datastore size in MB? The GNUnet datastore contains all data that GNUnet generates (index data, inserted and migrated content).
vi: Kích thước lớn nhất của kho dữ liệu tính theo MB? Kho dữ liệu GNUnet chứa tất cả các dữ liệu GNUnet tạo ra (dữ liệu chỉ mục, nội dung chèn và nhập vào).

source: Do you want to launch GNUnet as a system service? If you say "yes" here, the GNUnet background process will be automatically started when you turn on your computer. If you say "no" here, you have to launch GNUnet yourself each time you want to use it.
vi: Chạy GNUnet như một dịch vụ hệ thống? Nếu chọn "yes", tiến trình nền sau GNUnet sẽ tự động chạy khi bật máy tính. Nếu chọn "no", thì cần chạy GNUnet mỗi khi muốn sử dụng.

source: Define the user owning the GNUnet service. For security reasons, it is a good idea to let this setup create a new user account under which the GNUnet service is started at system startup. However, GNUnet may not be able to access files other than its own. This includes files you want to publish in GNUnet. You'll have to grant read permissions to the user specified below. Leave the fields empty to run GNUnet with system privileges. GNUnet user:
vi: Xác định người dùng sở hữu dịch vụ GNUnet. Vì lý do bảo mật, nên cho phép tạo một tài khoản người dùng mới sở hữu dịch vụ GNUnet chạy mỗi khi khởi động máy tính. Tuy nhiên, GNUnet chỉ có thể truy cập tới các tập tin mà nó sở hữu, bao gồm các tập tin người dùng muốn đưa ra chia sẻ trong GNUnet. Sẽ cần cho phép người dùng chỉ ra dưới đây quyền đọc chúng. Để trống để chạy GNUnet với quyền hệ thống. Người dùng GNUnet:

source: Define the group owning the GNUnet service. For security reasons, it is a good idea to let this setup create a new group for the chosen user account. You can also specify a already existant group here. Only members of this group will be allowed to start and stop the the GNUnet server and have access to GNUnet server data. GNUnet group:
vi: Xác định nhóm sở hữu dịch vụ GNUnet. Vì lý do bảo mật, nên để cài đặt này tạo một nhóm mới cho tài khoản người dùng đã chọn Cũng có thể chỉ ra một nhóm đã có. Chỉ thành viên của nhóm này mới có quyền chạy và dừng máy chủ GNUnet và có truy cập tới dữ liệu máy chủ GNUnet. Nhóm GNUnet:

source: If you are an experienced user, you may want to tweak your GNUnet installation using the enhanced configurator. Do you want to start it after saving your configuration?
vi: Nếu là một người dùng có kinh nghiệm, bạn có thể sửa đổi cấu hình của GNUnet bẳng trình cấu hình nâng cấp. Chạy nó sau khi ghi cấu hình?

source: Unable to save configuration file %s: %s. Try again?
vi: Không ghi nhớ được tập tin cấu hình %s: %s. Thử lại?

source: GNUnet configuration assistant
vi: Trình giúp cấu hình GNUnet

source: Next
vi: Tiếp

source: Cancel
vi: Dừng

source: Enter information about your network connection here. The "Network interface" is the device that connects your computer to the internet. This is usually a modem, an ISDN card or a network card in case you are using DSL. If your provider always assigns the same IP-Address to you (a "static" IP-Address), enter it into the "IP-Address" field. If your IP-Address changes every now and then ("dynamic" IP-Address) but there's a hostname that always points to your actual IP-Address ("Dynamic DNS"), you can also enter it here. If in doubt, leave the field empty. GNUnet will then try to determine your IP-Address. If you are connected to the internet through another computer doing SNAT, a router or a "hardware firewall" and other computers on the internet cannot connect to this computer, check the last option on this page. Leave it unchecked on direct connections through modems, ISDN cards and DNAT (also known as "port forwarding").
vi: Nhập thông tin về kết nối mạng tại đây. "Giao diện mạng" là thiết bị kết nối máy tính với internet. Đây thường là một môđem, một thẻ ISDN hay một thẻ mạng nếu dùng DSL. Nếu nhà cung cấp luôn luôn gán cùng một địa chỉ IP (một địa chỉ IP "tĩnh"), thì hãy nhập địa chỉ đó vào vùng "IP-Address". Nếu địa chỉ IP thay đổi sau mỗi lần kết nối (địa chỉ IP "động") nhưng có một tên máy luôn luôn chỉ tới địa chỉ IP thực của bạn ("DNS động"), thì cũng có thể nhập nó ở đây. Nếu không biết phải làm gì, thì hãy để trống. GNUnet sẽ thử để nhận ra địa chỉ IP. Nếu kết nối internet qua một máy khác thực hiện SNAT, một bộ định tuyến router hay một "phần cứng tường lửa" và các máy khác trong internet không thể kết nối tới máy này, thì hãy chọn "yes". Trả lời "no" nếu kết nối thẳng qua môđem, thẻ ISDN, và DNAT (hay còng gọi là "chuyển tiếp cổng").

source: Network interface:
vi: Giao diện mạng:

source: IP-Address/Hostname:
vi: Địa chỉ IP/Tên máy:

source: Computer cannot receive inbound connections (SNAT/Firewall)
vi: Máy không thể nhận được kết nối đi vào (SNAT/Firewall)

source: Network connection
vi: Kết nối mạng

source: Back
vi: Quay lại

source: You can limit GNUnet's ressource usage here. "Bandwidth limitation" is how much data may be sent per second. If you have a flatrate you can set it to the maximum speed of your internet connection. The "Max. CPU usage" is the percentage of processor time GNUnet is allowed to use.
vi: Có thể giới hạn sử dụng tài nguyên của GNUnet ở đây. "Giới hạn băng thông" cho biết bao nhiêu dữ liệu có thể gửi mỗi giây. Nếu có một tốc độ đều thì có thể đặt thành tốc độ lớn nhất của kết nối internet. "Sử dụng CPU lớn nhất" là phần trăm thời gian của bộ xử lý cho phép GNUnet sử dụng.

source: Upstream (Bytes/s):
vi: Đi ra (Byte/giây):

source: Downstream (Bytes/s):
vi: Đi vào (Byte/giây):

source: Bandwidth limitation
vi: Giới hạn băng thông

source: Use denoted bandwidth for GNUnet
vi: Sử dụng băng thông chỉ ra cho GNUnet

source: Share denoted bandwidth with other applications
vi: Chia sẻ băng thông chỉ ra với các ứng dụng khác

source: Bandwidth sharing
vi: Chia sẻ băng thông

source: Max. CPU usage (%):
vi: Sử dụng CPU lớn nhất (%):

source: CPU usage
vi: Sử dụng CPU

source: Load limitation
vi: Giới hạn nạp

source: Store migrated content
vi: Chứa nội dung đã nhập

source: Maximum datastore size (MB):
vi: Kích thước kho dữ liệu lớn nhất (MB):

source: Start the GNUnet background process on computer startup
vi: Chạy tiến trình GNUnet trong nền sau khi khởi động máy tính

source: Open the enhanced configurator
vi: Mở trình cấu hình nâng cao

source: Other settings
vi: Thiết lập khác

source: Finish
vi: Kết thúc

source: Question
vi: Câu hỏi

source: Do you want to save your settings?
vi: Ghi thiết lập?

source: Yes
vi: Có

source: No
vi: Không

source: Unable to save configuration!
vi: Không ghi được thiết lập!

source: OK
vi: Ừ

source: Define the user and the group owning the GNUnet service here. For security reasons, it is a good idea to let this setup create a new user account and a new group under which the GNUnet service is started at system startup. However, GNUnet may not be able to access files other than its own. This includes files you want to publish in GNUnet. You'll have to grant read permissions to the user specified below. Leave the fields empty to run GNUnet with system privileges.
vi: Xác định người dùng và nhóm sở hữu dịch vụ GNUnet ở đây. Vì lý do bảo mật, nên cho phép tạo một tài khoản người dùng và một nhóm mới sở hữu dịch vụ GNUnet chạy mỗi khi khởi động máy tính. Tuy nhiên, GNUnet chỉ có thể truy cập tới các tập tin mà nó sở hữu, bao gồm các tập tin người dùng muốn đưa ra chia sẻ trong GNUnet. Sẽ cần cho phép người dùng chỉ ra dưới đây quyền đọc chúng. Để trống để chạy GNUnet với quyền hệ thống.

source: Group:
vi: Nhóm:

source: User account:
vi: Tài khoản người dùng:

source: Can't open Service Control Manager
vi: Không mở được Trình Quản Lý Điều Khiển Dịch Vụ

source: Can't create service
vi: Không tạo được dịch vụ

source: Error changing the permissions of the GNUnet directory
vi: Lỗi thay đổi quyền hạn của thư mục GNUnet

source: Cannot write to the regisitry
vi: Không ghi được tới bản ghi

source: Can't access the service
vi: Không truy cập được dịch vụ

source: Can't delete the service
vi: Không xóa được dịch vụ

source: Unknown error
vi: Lỗi không rõ

source: This version of Windows does not support multiple users.
vi: Phiên bản này của Windows không hỗ trợ nhiều người dùng.

source: Error creating user
vi: Lỗi tạo người dùng

source: Error accessing local security policy
vi: Lỗi truy cập chính sách bảo mật nội bộ

source: Error granting service right to user
vi: Lỗi chuyển quyền hạn dịch vụ tới cho người dùng

source: Unknown error while creating a new user
vi: Lỗi không rõ khi tạo một người dùng mới

source: Message details: %u: length %d, priority: %d
vi: Chi tiết về thông báo: %u: dài %d, ưu tiên: %d

source: Invalid sequence number %u <= %u, dropping message.
vi: Số của chuỗi sai %u <= %u, đang bỏ đi thông báo.

source: Message received more than one day old. Dropped.
vi: Thông báo nhận được cũ hơn một ngày. Đã loại bỏ.

source: # outgoing messages dropped
vi: # thông báo đi ra đã loại bỏ

source: # bytes of outgoing messages dropped
vi: # byte của các thông báo đi ra đã loại bỏ

source: # connections closed (HANGUP sent)
vi: # các kết nối đã đóng (gửi HANGUP)

source: Could not release %p: service not loaded
vi: Không phát hành được %p: chưa nạp dịch vụ

source: No applications defined in configuration!
vi: Không có ứng dụng định nghĩa trong cấu hình!

source: FATAL: Identity plugin not found!
vi: LỖI NẶNG: Không tìm thấy plugin đồng nhất!

source: Print information about GNUnet peers.
vi: In thông tin về các đầu peer của GNUnet.

source: Transport %d not available
vi: Giao thông %d là không thể

source: Connection failed
vi: Kết nối không thành công

source: Connection failed (bug?)
vi: Kết nối thất bại (lỗi bug?)

source: No reply received within %llums.
vi: Không nhận được trả lời trong %llu miligiây.

source: ping peers from HOSTLISTURL that match transports
vi: ping các đầu peer từ HOSTLISTURL tương ứng với truyền tải

source: send COUNT messages
vi: gửi COUNT thông báo

source: send messages with SIZE bytes payload
vi: gửi các thông báo với SIZE byte nạp trả

source: specifies which TRANSPORT should be tested
vi: chỉ ra TRANSPORT cần được thử nghiệm

source: specifies after how many MS to time-out
vi: chỉ ra hết thời gian chờ sau bao nhiên MS

source: run as user LOGIN
vi: chạy dưới người dùng LOGIN

source: Tool to test if GNUnet transport services are operational.
vi: Công cụ để thử nghiệm xem dịch vụ truyền tải GNUnet có hoạt động không.

source: You must specify a non-empty set of transports to test!
vi: Người dùng phải chỉ ra một bộ không rỗng của truyền tải để thử nghiệm!

source: Testing transport(s) %s
vi: Đang thử nghiệm (các) truyền tải %s

source: Available transport(s): %s
vi: (Các) truyền tải có: %s

source: %d out of %d peers contacted successfully (%d times transport unavailable).
vi: đã kết nối thành công %d từ %d đầu peer (có %d lần truyền tải).

source: print a value from the configuration file to stdout
vi: in một giá trị từ tập tin cấu hình ra stdout

source: Updates GNUnet datastructures after version change.
vi: Cập nhật cấu trúc dữ liệu GNUnet sau khi thay đổi phiên bản.

source: Exiting.
vi: Đang thoát.

source: Updated data for %d applications.
vi: Cập nhật dữ liệu cho %d ứng dụng.

source: run in debug mode; gnunetd will not daemonize and error messages will be written to stderr instead of a logfile
vi: chạy trong chế độ tìm sửa lỗi debug; gnunetd sẽ không tạo daemon và sẽ ghi thông báo lỗi ra stderr thay vì vào một tập tin bản ghi log

source: Starts the gnunetd daemon.
vi: Chạy daemon gnunetd.

source: Invalid command-line arguments:
vi: Sai tham số dòng lệnh:

source: Invalid command-line arguments.
vi: Sai tham số dòng lệnh.

source: %s failed, message type %d already in use.
vi: %s thất bại, dạng thông báo %d đã sử dụng.

source: Failed to obtain my (external) IPv6 address!
vi: Không lấy được địa chỉ IPv6 (ngoài) của tôi!

source: Expected welcome on http connection, got garbage. Closing connection.
vi: Mong chào mừng từ kết nối http, nhận được rác. Đang đóng kết nối.

source: %s: Rejected connection from blacklisted address %u.%u.%u.%u.
vi: %s: Nhả ra kết nối có trong danh sách đen từ %u.%u.%u.%u.

source: HTTP: Could not determine my public IP address.
vi: HTTP: Không nhận ra địa chỉ IP công cộng của tôi.

source: Cannot connect to %u.%u.%u.%u:%u: %s
vi: Không kết nối được tới %u.%u.%u.%u:%u: %s

source: Could not bind the HTTP listener to port %d. No transport service started.
vi: Không kết gắn được trình nghe HTTP tới cổng %d. Dịch vụ truyền tải chưa chạy.

source: # bytes received via HTTP
vi: # byte nhận được qua HTTP

source: # bytes sent via HTTP
vi: # byte gửi qua HTTP

source: # bytes dropped by HTTP (outgoing)
vi: # byte loại bỏ bởi HTTP (đi ra)

source: Received malformed message via SMTP (size mismatch).
vi: Nhận được thông báo bị hỏng qua SMTP (kích thước không tương ứng).

source: No filter for E-mail specified, cannot create SMTP advertisement.
vi: Không chỉ ra đầu lọc cho E-mail, không tạo được quảng cáo SMTP.

source: SMTP server send unexpected response at %s:%d.
vi: Máy chủ SMTP gửi cầu trả lời không mong đợi tại %s: %d.

source: %.*s filter %s (SMTP)
vi: %.*s đầu lọc %s (SMTP)

source: Expected welcome message on tcp connection, got garbage (%u, %u). Closing.
vi: Mong đợi chào mừng trên kết nối tcp, nhận được rác (%u, %u). Đang đóng.

source: Received malformed message (size %u) from tcp-peer connection. Closing.
vi: Nhận được thông báo bị hỏng (kích thước %u) từ kết nối tcp-đầu peer. Đang đóng.

source: Could not determine my public IP address.
vi: Không nhận ra địa chỉ IP công cộng của tôi.

source: Failed to start transport service on port %d.
vi: Chạy dịch vụ truyền tải trên cổng %d thất bại.

source: # bytes received via TCP
vi: # byte nhận được qua TCP

source: # bytes sent via TCP
vi: # Byte gửi qua TCP

source: # bytes dropped by TCP (outgoing)
vi: # byte loại đi bởi TCP (đi ra)

source: Expected welcome message on tcp connection, got garbage. Closing.
vi: Mong chào mừng từ kết nối tcp, nhận được rác. Đang đóng.
