Repository: pruby/GNUnet-Mirror
Catalog: debian/po/*.po
Languages: es, ru, sv

source: Former installation of GNUnet detected
es: Se ha encontrado una instalación previa de GNUnet.
ru: Обнаружена предыдущая установка GNUnet
sv: Tidigare installation av GNUnet hittades

source: Since there are important changes in this version, the installer will need to modify the GNUnet configuration file (/etc/gnunet.conf).
ru: Так как в данной версии произошли важные изменения, при установке будет изменён файл конфигурации GNUnet (/etc/gnunet.conf).
sv: Eftersom det finns viktiga ändringar i denna version behöver installeraren göra ändringar i konfigurationsfilen för GNUnet (/etc/gnunet.conf).

source: The installation process will backup /etc/gnunet.conf to /etc/gnunet.conf.old, and will automatically build a new configuration file.
es: El proceso de instalación hará un copia de seguridad de /etc/gnunet.conf en /etc/gnunet.conf.old y creará un nuevo fichero de configuración.
ru: Во время установки будет создана резервная копия /etc/gnunet.conf с именем /etc/gnunet.conf.old, и будет создан новый конфигурационный файл.
sv: Installationsprocessen kommer att säkerhetskopiera /etc/gnunet.conf till /etc/gnunet.conf.old och automatiskt bygga en ny konfigurationsfil.

source: Every personal settings will be preserved as much as possible.
ru: Все пользовательские настройки будут перенесены насколько это возможно.
sv: Alla personliga inställningar kommer att behållas om möjligt.

source: Warning
es: Advertencia
ru: Внимание
sv: Varning

source: For some obscure reason, the installer have failed to discover the configuration settings in /etc/gnunet.conf.
ru: По неизвестной причине не удалось обнаружить настройки конфигурации в файле /etc/gnunet.conf.
sv: Av någon underlig anledning misslyckades installeraren att identifiera dina konfigurationsinställningar i /etc/gnunet.conf.

source: The old configuration file will be moved to /etc/gnunet.conf.old.
ru: Старый конфигурационный файл будет сохранён под именем /etc/gnunet.conf.old.
sv: Den gamla konfigurationsfilen kommer att flyttas till /etc/gnunet.conf.old.

source: Since some changes are *mandatory* in this file, a fresh default configuration file will now be installed
es: Se instalará un nuevo fichero nuevo de configuración, dado que algunos cambios son *obligatorios* en este fichero.
ru: Так как в этом файле нужно *обязательно* сделать некоторые изменения, будет установлен новый конфигурационный файл
sv: Eftersom vissa ändringar är *obligatoriska* i denna fil kommer en färsk standardkonfigurationsfil nu att installeras

source: Please take a look and make necessary changes in it if needed after installation.
es: Consulte el fichero y haga los cambios pertinentes, si fuera necesario, después de la instalación.
ru: После установки обязательно просмотрите его и сделайте необходимые изменения.
sv: Ta en titt på den och gör nödvändiga ändringar i den om det behövs efter installationen.

source: Upgrade from a version prior to 0.7.0
es: Actualizar desde una versión anterior a 0.7.0
ru: Обновление с версии меньшей 0.7.0
sv: Uppgradering från en version före 0.7.0

source: It seems that you are upgrading GNUnet from a version prior to 0.7.x. GNUnet 0.7.x introduced new configuration files and a new database storage format which is not compatible with versions prior to 0.7.x.
es: Parece que está actualizando GNUnet desde una versión anterior a 0.7.x. GNUnet 0.7.x introdujo nuevos ficheros de configuración y un nuevo formato en la base de datos que son incompatibles con las versiones anteriores a la 0.7.x.
ru: Кажется, что вы производите обновление GNUnet с версии меньше 0.7.x. В GNUnet 0.7.x появились новые конфигурационные файлы и новый формат хранилища данных, который не совместим с версиями меньше 0.7.x.
sv: Det verkar som om du uppgraderar GNUnet från en version före 0.7.x. GNUnet 0.7.x introducerade nya konfigurationsfiler och ett nytt lagringsformat för databasen som inte är kompatibel med versioner före 0.7.x.

source: GNUnet cannot convert your database format to the new format.
es: GNUnet no puede transformar el formato de su base de datos al nuevo formato.
ru: GNUnet не может преобразовать вашу базу данных в новый формат.
sv: GNUnet kan inte konvertera din databas till det nya formatet.

source: Your database storage will be automatically moved to /var/lib/GNUnet.prior07, and the gnunet package will build a new empty storage for you.
es: Su base de datos se trasladará automáticamente a /var/lib/GNUnet.prior07, y el paquete gnunet le construirá una nueva base de datos.
ru: Хранилище вашей базы данных будет автоматически перенесено в /var/lib/GNUnet.prior07, а пакет gnunet создаст новое пустое хранилище.
sv: Din databas kommer att flyttas automatiskt till /var/lib/GNUnet.prior07 och gnunet-paketet kommer att bygga en ny tom lagringsplats åt dig.

source: Your /etc/gnunet.conf file will also be moved to /etc/gnunet.conf.prior07 and replaced by /etc/gnunetd.conf which you can modify later by running "gnunet-setup -d -c /etc/gnunetd.conf", as root.
es: Su fichero /etc/gnunet.conf será también trasladado a /etc/gnunet.conf.prior07 y remplazado por /etc/gnunetd.conf, que podrá modificar más tarde ejecutando , como root, «gnunet-setup -d -c /etc/gnunetd.conf».
ru: Ваш файл /etc/gnunet.conf также будет переименован в /etc/gnunet.conf.prior07 и заменён файлом /etc/gnunetd.conf, который позже вы можете изменить, запустив команду "gnunet-setup -d -c /etc/gnunetd.conf", имея права суперпользователя.
sv: Filen /etc/gnunet.conf kommer också att flyttas till /etc/gnunet.conf.prior07 och ersättas av /etc/gnunetd.conf som du senare kan ändra genom att köra "gnunet-setup -d -c /etc/gnunetd.conf", som root.

source: Should the GNUnet server be launched on boot?
ru: Запускать демон GNUnet при загрузке?
sv: Ska GNUnet-demonen startas vid systemets uppstart?

source: If you choose this option, a GNUnet server will be launched each time the system is started. Otherwise, you will need to launch GNUnet each time you want to use it.
ru: Если вы ответите утвердительно, сервер GNUnet будет запускаться каждый раз при загрузке системы. Или же вы можете сами запускать GNUnet каждый раз когда хотите им воспользоваться.
sv: Om du väljer det här alternativet kommer en GNUnet-server att startas varje gång som systemet startar upp. Om inte behöver du starta GNUnet varje gång du vill använda det.

source: GNUnet user:
ru: Пользователь GNUnet:
sv: GNUnet-användare:

source: Please choose the user that the GNUnet server process will run as.
ru: Введите пользователя с правами которого должен запускаться процесс демона GNUnet.
sv: Välj den användare som GNUnet-demonens process ska köra som.

source: This should be a dedicated account. If the specified account does not already exist, it will automatically be created, with no login shell.
ru: Это должна быть выделенная учётная запись. Если введённая учётная запись не существует, то она будет автоматически создана, при чём она не будет иметь регистрационную оболочку командной строки.
sv: Det här bör vara ett dedicerat konto. Om det angivna kontot inte finns kommer det automatiskt att skapas, utan något inloggningsskal.

source: GNUnet group:
ru: Группа GNUnet:
sv: GNUnet-grupp:

source: Please choose the group that the GNUnet server process will run as.
ru: Введите группу с правами которой должен запускаться процесс демона GNUnet.
sv: Välj den grupp som GNUnet-demonens process ska köra som.

source: This should be a dedicated group, not one that already owns data. Only the members of this group will have access to GNUnet data, and be allowed to start and stop the GNUnet server.
ru: Это должна быть выделенная группа, которой не принадлежат какие-либо данные. Только члены этой группы получат доступ к данным GNUnet и смогут запускать и останавливать сервер GNUnet.
sv: Det här bör vara en dedicerat grupp, inte en grupp som redan äger data. Endast medlemmar av den här gruppen kommer att få åtkomst till GNUnets data och kommer att tillåtas att starta och stoppa GNUnet-servern.

source: If you accept here, a GNUnet server will be started each time your machine starts. If you decline this option, you need to launch GNUnet each time you want to use it.
es: Si responde afirmativamente aquí, se iniciará un servidor GNUnet cada vez que su máquina arranque. Si rechaza esta opción, deberá ejecutar GNUnet usted mismo cada vez.

source: Define the user owning the GNUnet daemon process.
es: Especifique el usuario al que pertenecerá el proceso demonio GNUnet

source: For security reasons, it's best to create a new user exclusively for GNUnet.
es: Por razones de seguridad, lo mejor sería crear un nuevo usurio sólo para GNUnet.

source: If you choose this option, that user will automatically be created as a system user, for whom no login will be allowed.
es: Si elige esta opción, se creará el usuario automáticamente como un usuario del sistema. Este usuario no tendrá permisos para acceder de forma interactiva al sistema.

source: Define the group owning the GNUnet daemon process.
es: Especifique el grupo al que pertenecerá el proceso demonio GNUnet.

source: For security reason, the best is to create a new group for this, and make sure that it owns no data beside GNUnet's ones.
es: Por razones de seguridad, lo mejor sería crear un nuevo grupo sólo para esto, y estar seguros que este no posee más datos de los que a GNUnet le corresponden.

source: Only the members of this group are allowed to start and stop the GNUnet server and have access to GNUnet data.
es: Sólo los miembros de este grupo podrán iniciar o parar el servidor GNUnet y tendrán acceso a los datos de GNUnet.
